{
  "puzzles":[
    "Why are manhole covers round rather than square?",
    "Why is it that, when you turn on the hot water in a hotel, the hot water comes out instantly?",
    "How many points are there on the globe where, by walking one mile south, one mile east, and one mile north, you reach the place where you started?",
    "You have eight billiard balls. One of them is \"defective,\" meaning that it weighs more than the others. How do you tell, using a balance, which ball is defective in two weighings?",
    "Every man in a village of fifty couples has been unfaithful to his wife. Every woman in the village instantly knows when a man other than her husband has philandered (you know how small towns are) but not when her own husband has (\"always the last to know\"). The village's notolerance adultery statute requires that a woman who can prove her husband is unfaithful must kill him that very day. No woman would dream of disobeying this law. One day, the queen, who is known to be infallible, visits the village. She announces that at least one husband has been unfaithful. What happens? ",
    "Four people must cross a rickety footbridge at night. Many planks are missing, and the bridge can hold only two people at a time (any more than two, and the bridge collapses). The travelers must use a flashlight to guide their steps; otherwise they're sure to step through a missing space and fall to their death. There is only one flashlight. The four people each travel at different speeds. Adam can cross the bridge in one minute; Larry in two minutes; Edge takes five minutes; and the slowest person, Bono, needs ten minutes. The bridge is going to collapse in exactly seventeen minutes. How can all four people cross the bridge?",
    "An evil demon captures a large, unspecified number of dwarfs. At each dwarfs entry interview, the demon plants a red or green gem in the dwarf's forehead. The demon informs the new recruit that he, the dwarf, has an unremovable red or green jewel in his forehead; that he, the demon, is not going to tell him which color, nor will anyone else (the dwarfs are strictly forbidden to speak); that one of the colors denotes sniveling company spies and the other color denotes those particularly luckless captives who are not even sniveling company spies; that the demon does not choose to tell him which color denotes which, nor will he tell him, ever. End of entry interview. Every day the dwarfs line up in formation so that the demon can count them, just to make sure no one has escaped. One day the demon gets tired of the dwarfs and decides to get rid of them. He announces that he will set the dwarfs free, provided they all deduce the color of their gems. As a hint, he tells them that there is at least one dwarf with a red gem, and at least one with a green gem. To earn their collective freedom, the dwarfs must signal wordlessly at the daily lineup. All of the dwarfs with red gems are to step one pace forward, while the dwarfs with green gems remain behind. If they are correct, then all the dwarfs are free to go back to their homes in the coal mines. If they are not correct, all the dwarfs will be slaughtered on the spot. The dwarfs are free to take as long as they want to determine the colors of their gems. They are all perfectly logical, and all are dying to get back to their homes. What should they do? ",
    "Consider five holes in a line. One of them is occupied by a fox. Each night, the fox moves to a neighboring hole, either to the left or to the right. Each morning, you get to inspect a hole of your choice. What strategy would ensure that the fox is eventually caught?",
    "Mary baked a rectangular cake. Merlin secretly carved out a small rectangular piece, ate it and vanished! The remaining cake has to be split evenly between Mary's two kids. How could this be done with only one cut through the cake?",
    "With two eggs and a building with 100 floors, what is the optimal strategy for finding the lowest floor at which an egg will break when dropped? Followup: What if the number of floors of the building is unknown?"
  ]
}
